
# ***************** Pycharm 快捷键集合 *************************
'''
1、注释/取消注释   Ctrl + /
    可以选中多行批量注释，注释后再次按 Ctrl + / 取消注释

2、缩进/取消缩进   Tab/Shift + Tab
    Tab：缩进当前行（选中多行后可以批量缩进）
    Shift + Tab：取消缩进（选中多行可以批量取消缩进）

3、 任意位置换行   Shift + Enter

4、复制当前行     Ctrl + D

5、快速查看文档    Ctrl + Q
    快速查看方法、库等文档说明

6、简介及代码定义   Ctrl + 左键

7、快速查找  双击shift
    万能搜索，不管是IDE功能、文件、方法、变量等都能搜索。

8、删除选定的行    Ctrl + Y
    快速删除选定的行，不能再一格一格后退了

9、智能提示      Alt + Enter
    智能提示当前光标处可以进行的操作，快速给出语法提示。

10、快速排版     CTRL + Alt + L
    代码格式化，类似于autopep8的功能，快速实现代码排版。
'''